app/Controllers/Api/FinanceApiController.php

SELECT *
FROM `finance`
WHERE `finance`.`id` = '15'
UPDATE `finance` SET `berita` = 'Data 3', `jumlah` = '100000', `tipe` = 'kredit'
WHERE `finance`.`id` IN ('15')
---
    public function update($id = null)
    {
        $model = new FinanceModel();
        $model->find($id);

        if (empty($model)) {
            throw new \CodeIgniter\HTTP\Exceptions\HTTPException("Entity not found", 404);
        }

        $request = $this->request->getPost();
        $model->update($id, $request);

SELECT *
FROM `finance`
WHERE `finance`.`id` = '12'
DELETE FROM `finance`
WHERE `id` IN ('12')
---
    public function delete($id = null)
    {
        $model = new FinanceModel();
        $model->find($id);

        if (empty($model)) {
            throw new \CodeIgniter\HTTP\Exceptions\HTTPException("Entity not found", 404);
        }

        $model->delete($id);